// ============================================================
// FRONTEND CONFIGURATION
// ระบบบริหารจัดการศูนย์วิทยาศาสตร์การกีฬาและฟิตเนส
// ============================================================

const CONFIG = {

  // ----------------------------------------------------------
  // Google Apps Script Web App
  // ----------------------------------------------------------

  API_URL:
    'https://script.google.com/macros/s/AKfycbz831JXm1C6u64yq0FaWcGVneLXwxp9LGt88643WS1NhVixJGT474DL_CJ23_VmQW8o/exec',


  // ----------------------------------------------------------
  // API Token
  // ต้องตรงกับ Code.gs
  // ----------------------------------------------------------

  API_TOKEN:
    'SPORTS_SCI_SECURE_TOKEN_2026_XyZ99',


  // ----------------------------------------------------------
  // Application
  // ----------------------------------------------------------

  APP_NAME:
    'ระบบบริหารจัดการศูนย์วิทยาศาสตร์การกีฬาและฟิตเนส',

  DEVELOPER:
    'Dr.peerasak kingpoum',

  VERSION:
    'V.1.1',


  // ----------------------------------------------------------
  // API Settings
  // ----------------------------------------------------------

  JSONP_TIMEOUT:
    15000,

  POST_TIMEOUT:
    20000

};
